{"format": "keras", "nodes": [{"name": "augmenter_input", "id": "augmenter_input", "class_name": "InputLayer", "output_shape": [[3, 32, 32, 3]], "num_parameters": 0}, {"name": "augmenter", "id": "augmenter", "class_name": "Sequential", "output_shape": [null, 32, 32, 3], "num_parameters": 0}, {"name": "answer_encoder", "id": "answer_encoder", "class_name": "Sequential", "output_shape": [null, 512], "num_parameters": 1255808}, {"name": "problem_encoder", "id": "problem_encoder", "class_name": "ParallelApply", "output_shape": ["multiple"], "num_parameters": 370688}, {"name": "solver", "id": "solver", "class_name": "Sequential", "output_shape": [64, 3, 1], "num_parameters": 470913}], "edges": [["augmenter_input", "augmenter"], ["augmenter_input", "augmenter"]]}